tutorials/multiRegion/CHT/shellAndTubeHeatExchanger/0/solid/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/solid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 300;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    external
    {
        type            zeroGradient;
    }
    solid_to_shell
    {
        type            coupledTemperature;
        value           $internalField;
    }
    solid_to_tube
    {
        type            coupledTemperature;
        value           $internalField;
    }
}

// ************************************************************************* //
